Import sqlalchemy and pandas.

In [1]:
from sqlalchemy import create_engine
from sqlalchemy import inspect
import pandas as pd
import numpy as np

Import raw data into dataframe.

In [2]:
engine = create_engine("sqlite:///mta_raw_2018.db")
insp = inspect(engine)
print(insp.get_table_names())

['mta_data', 'university_location_mta']

SQLAlchemy: mta_data sample

In [3]:
mta_df= pd.read_sql('SELECT CA, UNIT, SCP, STATION, DATE, TIME, DESC, ENTRIES, EXITS, DATE_TIME FROM mta_data;', engine)
mta_df

,CA,UNIT,SCP,STATION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,08/25/2018,00:00:00,REGULAR,6736067,2283184,2018-08-25 00:00:00
1,A002,R051,02-00-00,59 ST,08/25/2018,04:00:00,REGULAR,6736087,2283188,2018-08-25 04:00:00
2,A002,R051,02-00-00,59 ST,08/25/2018,08:00:00,REGULAR,6736105,2283229,2018-08-25 08:00:00
3,A002,R051,02-00-00,59 ST,08/25/2018,12:00:00,REGULAR,6736180,2283314,2018-08-25 12:00:00
4,A002,R051,02-00-00,59 ST,08/25/2018,16:00:00,REGULAR,6736349,2283384,2018-08-25 16:00:00
...,...,...,...,...,...,...,...,...,...,...
2784723,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,04:00:00,REGULAR,5554,366,2018-11-30 04:00:00
2784724,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,08:00:00,REGULAR,5554,366,2018-11-30 08:00:00
2784725,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,12:00:00,REGULAR,5554,366,2018-11-30 12:00:00
2784726,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,16:00:00,REGULAR,5554,366,2018-11-30 16:00:00
2784727,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,20:00:00,REGULAR,5554,366,2018-11-30 20:00:00

In [4]:
mta_df.dtypes

CA           object
UNIT         object
SCP          object
STATION      object
DATE         object
TIME         object
DESC         object
ENTRIES       int64
EXITS         int64
DATE_TIME    object
dtype: object

In [5]:
mta_df['DATE_TIME']= pd.to_datetime(mta_df['DATE']+mta_df['TIME'], format = "%m/%d/%Y%H:%M:%S")
mta_df

,CA,UNIT,SCP,STATION,DATE,TIME,DESC,ENTRIES,EXITS,DATE_TIME
0,A002,R051,02-00-00,59 ST,08/25/2018,00:00:00,REGULAR,6736067,2283184,2018-08-25 00:00:00
1,A002,R051,02-00-00,59 ST,08/25/2018,04:00:00,REGULAR,6736087,2283188,2018-08-25 04:00:00
2,A002,R051,02-00-00,59 ST,08/25/2018,08:00:00,REGULAR,6736105,2283229,2018-08-25 08:00:00
3,A002,R051,02-00-00,59 ST,08/25/2018,12:00:00,REGULAR,6736180,2283314,2018-08-25 12:00:00
4,A002,R051,02-00-00,59 ST,08/25/2018,16:00:00,REGULAR,6736349,2283384,2018-08-25 16:00:00
...,...,...,...,...,...,...,...,...,...,...
2784723,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,04:00:00,REGULAR,5554,366,2018-11-30 04:00:00
2784724,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,08:00:00,REGULAR,5554,366,2018-11-30 08:00:00
2784725,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,12:00:00,REGULAR,5554,366,2018-11-30 12:00:00
2784726,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,16:00:00,REGULAR,5554,366,2018-11-30 16:00:00
2784727,TRAM2,R469,00-05-01,RIT-ROOSEVELT,11/30/2018,20:00:00,REGULAR,5554,366,2018-11-30 20:00:00

In [6]:
mta_df.dtypes

CA                   object
UNIT                 object
SCP                  object
STATION              object
DATE                 object
TIME                 object
DESC                 object
ENTRIES               int64
EXITS                 int64
DATE_TIME    datetime64[ns]
dtype: object

SQLAlchemy: university_locations_mta sample

In [7]:
unv_loc= pd.read_sql('SELECT the_geom,LAT,LON,NAME,Technology,HOUSENUM,STREETNAME,CITY,ZIP,URL,BIN,BBL,STATION,MTA_STATION,DISTANCE,Division,Line,Station_Latitude,Station_Longitude,Route_1,Route_2,Route_3,Route_4,Route_5,Route_6,Route_7,Route_8,Route_9,Route_10,Route_11,Entrance_Type,Entry,Exit_Only,Vending,Staffing,Staff_Hours,ADA,ADA_Notes,Free_Crossover,North_South_Street,East_West_Street,Corner,Latitude,Longitude FROM university_location_mta;', engine)
unv_loc.describe()

,LAT,LON,ZIP,DISTANCE,Station_Latitude,Station_Longitude,Latitude,Longitude
count,126.000000,126.000000,126.000000,126.000000,126.000000,126.000000,126.000000,126.000000
mean,40.741779,-73.940249,10576.341270,0.005968,40.738754,-73.940496,40.738745,-73.940440
std,0.053586,0.073648,622.140604,0.006636,0.055445,0.074627,0.055429,0.074659
min,40.631766,-73.997878,10003.000000,0.001655,40.632836,-74.000495,40.631845,-74.001534
25%,40.725600,-73.990579,10010.000000,0.001655,40.712646,-73.991070,40.712499,-73.991267
50%,40.742405,-73.986661,10031.000000,0.003018,40.739864,-73.986270,40.739489,-73.986186
75%,40.742405,-73.888770,11207.750000,0.007766,40.745906,-73.897174,40.745453,-73.897219
max,40.874590,-73.791694,11432.000000,0.024987,40.873412,-73.783817,40.873528,-73.782119

In [8]:
unv_loc.dtypes

the_geom               object
LAT                   float64
LON                   float64
NAME                   object
Technology             object
HOUSENUM               object
STREETNAME             object
CITY                   object
ZIP                     int64
URL                    object
BIN                    object
BBL                    object
STATION                object
MTA_STATION            object
DISTANCE              float64
Division               object
Line                   object
Station_Latitude      float64
Station_Longitude     float64
Route_1                object
Route_2                object
Route_3                object
Route_4                object
Route_5                object
Route_6                object
Route_7                object
Route_8                object
Route_9                object
Route_10               object
Route_11               object
Entrance_Type          object
Entry                  object
Exit_Only              object
Vending                object
Staffing               object
Staff_Hours            object
ADA                    object
ADA_Notes              object
Free_Crossover         object
North_South_Street     object
East_West_Street       object
Corner                 object
Latitude              float64
Longitude             float64
dtype: object

SQLAlchemy 4 Commands: SELECT FROM LEFT JOIN ON AND GROUP BY WHERE

In [9]:
mta_unv = pd.read_sql('SELECT mta_data.STATION, mta_data.DIVISION, mta_data.LINENAME, university_location_mta.NAME FROM mta_data LEFT JOIN university_location_mta ON mta_data.STATION = university_location_mta.MTA_STATION AND mta_data.DIVISION = university_location_mta.DIVISION WHERE university_location_mta.NAME IS NOT NULL GROUP BY mta_data.STATION;', engine)
mta_unv

,STATION,DIVISION,LINENAME,NAME
0,116 ST-COLUMBIA,IRT,1,Columbia University
1,135 ST,IND,BC,The City College of New York
2,23 ST,BMT,NRW,Touro College
3,6 AV,BMT,FLM123,New School University / The New School
4,ASTOR PL,IRT,6,"Cooper Union, The / For The Advancement Of Sci..."
5,BEDFORD PK BLVD,IRT,4,Herbert H Lehman College (Cuny)
6,FLATBUSH AV-B.C,IRT,25,Brooklyn College (Cuny)
7,JAMAICA 179 ST,IND,F,St. John's University / Queens Campus
8,JAY ST-METROTEC,IND,ACF,Nyc Technical College (Cuny)
9,KEW GARDENS,IND,EF,Queens College (Cuny)
10,KINGSBRIDGE RD,IND,BD,Fordham University
11,W 4 ST-WASH SQ,IND,ABCDEFM,New York University

SQLAlchemy Subquery: Count the mta_data.Station rows based on the university stations.

In [10]:
stn_unv = pd.read_sql('SELECT COUNT(mta_data.STATION) FROM mta_data WHERE mta_data.STATION = (SELECT university_location_mta.MTA_STATION FROM university_location_mta);',engine)
stn_unv

   COUNT(mta_data.STATION)
0                     3551

SQLAlchemy CTE: Count MTA Stations from the temporary University_Table.

In [11]:
stn_unv = pd.read_sql('WITH UNIVERSITY_TABLE AS (SELECT NAME, MTA_STATION FROM university_location_mta) SELECT COUNT(MTA_STATION) FROM UNIVERSITY_TABLE;',engine)
stn_unv

   COUNT(MTA_STATION)
0                 126